*** flycheck-ruff

#+begin_src emacs-lisp
(use-package flymake-ruff
  :ensure t
  :hook (python-mode . flymake-ruff-load))
#+end_src

#+RESULTS:
| flymake-ruff-load | ruff-format-on-save-mode | elpy-mode | #[nil ((lsp-mode 1) (flycheck-mode nil)) nil] |


*** ruff formatting (on file save)

#+begin_src emacs-lisp
  (use-package reformatter
    :ensure t    
    :hook 
    (python-mode . ruff-format-on-save-mode)
    (python-ts-mode . ruff-format-on-save-mode)
    :config
    (reformatter-define ruff-format
      :program "ruff"
      :args `("format" "--config" "~/code/service-launch-ai/code/pyproject.toml" "--stdin-filename" ,buffer-file-name "-")))
#+end_src

#+RESULTS:
| ruff-format-on-save-mode |

* escape character filtering

- related to pytest output in terminal
- https://claude.ai/chat/acb68c2c-5b9f-481d-aa3a-2283e46076a6

#+begin_src emacs-lisp
  (defun filter-osc-9-4-compile ()
    "Filter out OSC 9;4 escape sequences and all stray backslashes."
    (save-excursion
      ;; First pass: remove OSC sequences
      (goto-char compilation-filter-start)
      (while (search-forward "]9;4;" nil t)
        (let ((start (- (point) 6)))
          (when (re-search-forward "[^\\]*\\\\" nil t)
            (delete-region start (point)))))
      ;; Second pass: remove any remaining backslashes that shouldn't be there
      ;; This handles \=, \., and trailing backslashes
      (goto-char compilation-filter-start)
      (while (re-search-forward "\\\\\\([.=:\n]\\|$\\)" nil t)
        (replace-match "\\1"))))

  (remove-hook 'compilation-filter-hook 'filter-osc-9-4-compile)
  (add-hook 'compilation-filter-hook 'filter-osc-9-4-compile)
#+end_src

#+RESULTS:
| filter-osc-9-4-compile |

